[
    {
        "name": "Godan (Hindi)",
        "description": "Godan is a Hindi novel by Munshi Premchand, It was first published in 1936 and is considered one of the greatest Hindustani novels of modern Indian literature. Themed around the socio economic deprivation as well as the exploitation of the village poor, the novel was the last complete novel of Premchand.",
        "category": "Book",
        "author": {
            "name": "Premchand",
            "description": "Munshi Premchand, an Indian writer (novel writer, story writer and dramatist), was born in the year 1880 at 31st of July in the Lamhi village (near Varanasi). He is the famous writer of the early 20th century. He got died at 8th of October in 1936 by serving the people with his great writings. The birth name of him is Dhanpat Rai Srivastav and pen name is Nawab Rai. He wrote his all writings with his pen name. Finally his name changed to the Munshi Premchand. His first name Munshi is an honorary prefix given by his lovers in the society because of his quality and effective writings. As a Hindi writer he wrote approximately dozen novels, 250 short stories, numerous essays and translations."
        },
        "type": "book",
        "publisher": "Maple Press, Pvt Ltd; First Edition (24 August 2015); Maple Press, Noida",
        "language": "Hindi",
        "paperback": "392 pages",
        "readingAge": "Customer suggested age: 12 years and up",
        "itemWeight": "375 g",
        "countryOfOrigin": "India"
    },
    {
        "name": "That Night: Four Friends, Twenty Years",
        "description": "Natasha, Riya, Anjali and Katherine were best friends in college - each different from the other yet inseparable - until that night.  It was the night that began with a bottle of whisky and a game of Ouija but ended with the death of Sania, their unlikeable hostel mate. The friends vowed never to discuss that fateful night, a pact that had kept their friendship and guilt dormant for the last twenty years.  But now, someone has begun to mess with them, threatening to reveal the truth that only Sania knew. Is it a hacker playing on their guilt or has Sania's ghost really returned to avenge her death?  As the faceless enemy closes in on them, the friends come together once again to recount what really happened that night. But when the story is retold by each of them, the pieces don't fit. Because none of them is telling the whole truth.That Night is a dark, twisted tale of friendship and betrayal that draws you in and confounds you at every turn.",
        "category": "Book",
        "author": {
            "name": "Nidhi Upadhyay",
            "description": " Nidhi Upadhyay is an engineer-turned-headhunter. For years, Nidhi spent her days matchmaking senior executives to their dream jobs and her nights reading thrillers, until her husband borderline bullied her into writing one. She lives in Singapore with her doting husband and two exceptionally loving but polar-opposite boys. That Night is her debut novel."
        },
        "type": "book",
        "publisher": " Penguin (5 April 2021); Penguin Random House India",
        "language": "English",
        "paperback": "288 pages",
        "readingAge": "",
        "itemWeight": "210 g",
        "countryOfOrigin": "India"
    },
    {
        "name": "I Hear You: Most expectant mothers talk to their unborn. But what if the unborn starts to respond? | A psychological thriller with jaw-dropping twists.",
        "description": " Most expectant mothers talk to their unborn. But what if the unborn starts to respond? Mahika is hoping that a baby will breathe new life into her dead marriage. But all her pregnancies meet the same fate, because no baby is perfect for Shivam, her genius geneticist husband. Until there is one. Rudra, the world's first genetically altered foetus, is Shivam's perfect creation and Mahika's last hope. The six-week-pregnant Mahika has just walked into her fertility clinic when she discovers an anonymous note that discloses the ugly truth behind her pregnancy. Before Mahika can come to terms with the fact that her husband's quest for perfection has marked its territory in her womb, she finds herself locked in her own house. But then she discovers that her unborn son has extraordinary powers. As weeks pass by, Rudra calibrates and recalibrates his powers with one aim-Mahika's freedom. But Rudra needs more than his newly acquired powers to free his mother. He needs to betray his creator, his father. And he must do it before it's too late. ",
        "category": "Book",
        "author": {
            "name": "Nidhi Upadhyay",
            "description": " Nidhi Upadhyay is an engineer-turned-headhunter. For years, Nidhi spent her days matchmaking senior executives to their dream jobs and her nights reading thrillers, until her husband borderline bullied her into writing one. She lives in Singapore with her doting husband and two exceptionally loving but polar-opposite boys. That Night is her debut novel."
        },
        "type": "book",
        "publisher": "Penguin eBury Press",
        "language": "English",
        "paperback": "288 pages",
        "itemWeight": "300 g",
        "countryOfOrigin": "India"
    }
]