[
    {
        "type": "phone",
        "productId": "64d4ce5290b2f3793514d2d9",
        "name": "Apple iPhone 14 (128 GB) - Blue ",
        "description": "15.40 cm (6.1-inch) Super Retina XDR display  | Advanced camera system for better photos in any light  | Cinematic mode now in 4K Dolby Vision up to 30 fps  | Action mode for smooth, steady, handheld videos  | Vital safety technology — Crash Detection calls for help when you can’t  | All-day battery life and up to 20 hours of video playback  | Industry-leading durability features with Ceramic Shield and water resistance  | A15 Bionic chip with 5-core GPU for lightning-fast performance. Superfast 5G cellular  | iOS 16 offers even more ways to personalise, communicate and share",
        "category": "Phone",
        "display": "6.1-inch Super Retina XDR display",
        "capacity": "128GB, 256GB, 512GB",
        "rearCamera": "Dual-camera system: 12MP Main, 12MP Ultrawide with Portrait mode, Depth Control, Portrait Lighting, Smart HDR 4, and 4K Dolby Vision HDR video up to 60 fps",
        "frontCamera": "12MP TrueDepth front camera with Portrait mode, Depth Control, Portrait Lighting, and Smart HDR 4",
        "batteryBackup": "Video playback: Up to 20 hours Video playback (streamed): Up to 16 hours Audio playback: Up to 80 hours 20W adapter or higher (sold separately) Fast-charge capable:Up to 50% charge in around 30 minutes with 20W adapter or higher (available separately)",
        "warrenty": "Apple-branded hardware product and accessories contained in the original packaging (“Apple Product”) come with a One-Year Limited Warranty. See apple.com/in/legal/warranty for more information.",
        "height": "5.78 inches (146.7 mm)"
    },
    {
        "type": "phone",
        "productId": "64d4ce5290b2f3793514d2d9",
        "name": "Samsung Galaxy S23 5G (Lavender, 8GB, 256GB Storage)",
        "description": "More light for your night - Get ready for a Gallery full of epic night shots everyone will want. Nightography's enhanced AI keeps details clear, so low light photos and videos will be bright and colorful from dusk to dawn and back again.  | Designed with the planet in mind - Unbox the change you want to see in the world. Crafted with recycled glass and PET film and colored with natural dyes, each phone is tucked into a box made of recycled paper and paper-based protective film.  | Power for those who don't pause - Your quest for epic mobile gaming is over. Snapdragon 8 Gen 2 Mobile Platform for Galaxy optimizes and streamlines your device for silky smooth games —without draining the battery.",
        "category": "Phone",
        "display": "6.8” Dynamic AMOLED 2X Infinity-O QHD+ Edge Screen. 120Hz Adaptive Refresh Rate ",
        "capacity": "12GB Memory | 256GB / 512GB / 1TB Storage",
        "rearCamera": "50MP",
        "frontCamera": "12MP TrueDepth front camera with Portrait mode, Depth Control, Portrait Lighting, and Smart HDR 4",
        "batteryBackup": "5,000mAh",
        "warrenty": "1 Year",
        "height": "5.78 inches (146.7 mm)",
        "specs": {
            "Operating System": "Android 13.0",
            "Model Name": "Samsung Galaxy S23"
        }
    }
]
